In [1]:
pip install pandas

Collecting pandas
  Downloading pandas-2.3.2-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\aldawlia\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.3.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\aldawlia\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\aldawlia\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.2-cp312-cp312-win_amd64.whl (11.0 MB)
   ---------------------------------------- 0.0/11.0 MB ? eta -:--:--
    --------------------------------------- 0.3/11.0 MB ? eta -:--:--
   - -------------------------------------- 0.5/11.0 MB 2.4 MB/s eta 0:00:05
   --- ------------------------------------ 1.0/11.0 MB 1.6 MB/s eta 0:00:07
   ----- ---------------------------------- 1.6/11.0 MB 2.0 MB/s eta 0:00:05
   ------ --------------------------------- 1.8/11.0 MB 2.1 MB/s eta 0:00:05
   ------ --------------------------------- 1.8/11.0 MB 2.1 MB/s eta 0:00:05
   ------ --------------------------------- 1.8/11.0 MB 2.1 MB/s eta 0:00:05
   ------- -------------------------------- 2.1/11.0 MB 1.2 MB/s eta 0:00:08
   -------- ------------------------------- 2.4/11.0 MB 1.2 MB/s eta 0:00:08
   --------- ------------------------------ 2.6/11.0 MB 1.1 MB/s eta 0:00:08
   ----------- ---------------------------- 3.1/11.0 MB 1.2 MB/s eta 0:00:07
   -------------- ------------------------- 3.9/11.0 MB 1.4 MB/s eta 0:00:06
   -------------- ------------------------- 3.9/11.0 MB 1.4 MB/s eta 0:00:06
   -------------- ------------------------- 3.9/11.0 MB 1.4 MB/s eta 0:00:06
   --------------- ------------------------ 4.2/11.0 MB 1.2 MB/s eta 0:00:06
   ---------------- ----------------------- 4.5/11.0 MB 1.2 MB/s eta 0:00:06
   ---------------- ----------------------- 4.5/11.0 MB 1.2 MB/s eta 0:00:06
   ---------------- ----------------------- 4.5/11.0 MB 1.2 MB/s eta 0:00:06
   ----------------- ---------------------- 4.7/11.0 MB 1.1 MB/s eta 0:00:06
   ------------------ --------------------- 5.0/11.0 MB 1.1 MB/s eta 0:00:06
   ------------------- -------------------- 5.2/11.0 MB 1.1 MB/s eta 0:00:06
   --------------------- ------------------ 5.8/11.0 MB 1.2 MB/s eta 0:00:05
   ---------------------- ----------------- 6.3/11.0 MB 1.2 MB/s eta 0:00:04
   ------------------------ --------------- 6.8/11.0 MB 1.2 MB/s eta 0:00:04
   -------------------------- ------------- 7.3/11.0 MB 1.3 MB/s eta 0:00:03
   ---------------------------- ----------- 7.9/11.0 MB 1.3 MB/s eta 0:00:03
   ------------------------------ --------- 8.4/11.0 MB 1.4 MB/s eta 0:00:02
   --------------------------------- ------ 9.2/11.0 MB 1.5 MB/s eta 0:00:02
   ------------------------------------- -- 10.2/11.0 MB 1.5 MB/s eta 0:00:01
   ---------------------------------------  10.7/11.0 MB 1.6 MB/s eta 0:00:01
   ---------------------------------------  10.7/11.0 MB 1.6 MB/s eta 0:00:01
   ---------------------------------------- 11.0/11.0 MB 1.5 MB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.3.2 pytz-2025.2 tzdata-2025.2
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

In [3]:
s = pd.Series([1,2,3,4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
s = pd.Series([1,2,3,4], index = ['A' , 'B','C','D'])
s

A    1
B    2
C    3
D    4
dtype: int64

In [6]:
data = [[1,444,'renad'],
        [2,555,'ahmed'],
        [3,666,'renad'],
        [4,777,'ahmed']]

df = pd.DataFrame(data, columns = ['index','std-ID','Name'])
df

   index  std-ID   Name
0      1     444  renad
1      2     555  ahmed
2      3     666  renad
3      4     777  ahmed

In [8]:
data = {'index' : [1,444,'Renad'],
       'std_ID' : [2,555,'ahmed'],
        
}

df = pd.DataFrame(data)
df

   index std_ID
0      1      2
1    444    555
2  Renad  ahmed

In [10]:
data = df = pd.DataFrame([[1,444,'renad'],
        [2,555,'ahmed'],
        [3,666,'sara'],
        [4,777,'habiba']

])

# display(df)
# cols = ['A','B','C']
# df.columns = cols
idx = ['row_1','row_2','row_3','row_4']
df.index = idx
display(df)

       0    1       2
row_1  1  444   renad
row_2  2  555   ahmed
row_3  3  666    sara
row_4  4  777  habiba

In [11]:
data = df = pd.DataFrame([[1,444,'eeee'],
        [2,555,'ahmed'],
        [3,666,'renad'],
        [4,777,'habiba']

])

df = pd.DataFrame(data)
df

   0    1       2
0  1  444    eeee
1  2  555   ahmed
2  3  666   renad
3  4  777  habiba

In [12]:
df.dtypes

0     int64
1     int64
2    object
dtype: object

In [13]:
df[2].dtype

dtype('O')

In [14]:
cols = [0,1 , 2]
df[cols] = df[cols].astype('category')
df.dtypes

0    category
1    category
2    category
dtype: object

In [15]:
s = pd.Series([1,2,3], index = ['Index' , 'Std_ID','Name'])
s

Index     1
Std_ID    2
Name      3
dtype: int64

In [16]:
df['Index'] = df[0].astype('int')
df.dtypes

0        category
1        category
2        category
Index       int64
dtype: object

In [17]:
df.info

<bound method DataFrame.info of    0    1       2  Index
0  1  444    eeee      1
1  2  555   ahmed      2
2  3  666   renad      3
3  4  777  habiba      4>

In [18]:
df.describe()

          Index
count  4.000000
mean   2.500000
std    1.290994
min    1.000000
25%    1.750000
50%    2.500000
75%    3.250000
max    4.000000

In [19]:
df.columns

Index([0, 1, 2, 'Index'], dtype='object')

In [20]:
df.describe(include = int)

          Index
count  4.000000
mean   2.500000
std    1.290994
min    1.000000
25%    1.750000
50%    2.500000
75%    3.250000
max    4.000000

In [21]:
df[2].unique()

['eeee', 'ahmed', 'renad', 'habiba']
Categories (4, object): ['ahmed', 'eeee', 'habiba', 'renad']

In [23]:
data = df = pd.DataFrame([[1,1,'renad'],
        [2,3,'ahmed'],
        [3,5,'renad'],
        [4,100,'ahmed']

])

df = pd.DataFrame(data)
df

   0    1      2
0  1    1  renad
1  2    3  ahmed
2  3    5  renad
3  4  100  ahmed

In [24]:
df[1].idxmax()

3

In [25]:
df[1].idxmin()

0

In [26]:
df.values

array([[1, 1, 'renad'],
       [2, 3, 'ahmed'],
       [3, 5, 'renad'],
       [4, 100, 'ahmed']], dtype=object)

In [27]:
df.replace(1,"ahmed")

       0      1      2
0  ahmed  ahmed  renad
1      2      3  ahmed
2      3      5  renad
3      4    100  ahmed

In [28]:
df.replace({4 : "Amir"})

      0    1      2
0     1    1  renad
1     2    3  ahmed
2     3    5  renad
3  Amir  100  ahmed

In [29]:
df.iloc[2,1]

np.int64(5)

In [30]:
x = df.iloc[:,:-1]
x

   0    1
0  1    1
1  2    3
2  3    5
3  4  100

In [32]:
new_col = df[0] + df[1]
new_col

0      2
1      5
2      8
3    104
dtype: int64

In [33]:
df.insert(3, 'new_col',new_col)

In [36]:
x = df.iloc[:,:]
x

   0    1      2  new_col
0  1    1  renad        2
1  2    3  ahmed        5
2  3    5  renad        8
3  4  100  ahmed      104

In [37]:
df.drop('new_col', axis = 1)

   0    1      2
0  1    1  renad
1  2    3  ahmed
2  3    5  renad
3  4  100  ahmed

In [38]:
new_row = {0 : 5}